<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"c41bd42f8ec998b73b26c4c4a926cec0671bd154f31af760e013441c0f84f0d6","plan_job_ref":"Job Create terraform plan #51 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/16866843852","plan_out_hash":"c4e9a21e92f190e9f146bc57057632753f72f24ae4bf82a71167f8a9aa1944aa","plan_hash":"80d22947e278c27cd62e3a282b7a451f3e7c8f9e5ef0c84a99bcad3032f7fb79","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __infrastructure__
With variables: `environment = "prd"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # azuread_application.client will be created
+   resource "azuread_application" "client" {
+       app_role_ids                = (known after apply)
+       client_id                   = (known after apply)
+       description                 = "Application to login to the Projectcoordinator application"
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "Projectcoordinator-prd"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "b922cbd6-faf0-409e-8e8d-2a0334440228",
        ]
+       prevent_duplicate_names     = true
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       feature_tags (known after apply)

+       password (known after apply)

+       required_resource_access {
+           resource_app_id = "************************************"

+           resource_access {
+               id   = "b340eb25-3456-403f-be2f-af7a0d370277"
+               type = "Scope"
            }
        }

+       single_page_application {
+           redirect_uris = [
+               "https://lively-rock-09b64e403.2.azurestaticapps.net/authentication/login-callback",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #51](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/16866843852)